###3° Parcial: Aplicaciones de Programación Linea

**2.Compañeros de Habitacion **

In [1]:
import numpy as np
import pandas as pd
import random as random

Primero generamos a nuestros compañeros. En este caso,tomaremos como base  creando solamente a cinco personas. Esas cinco personas estaran definidas por indice. Por ejemplo, en este caso, tenemos a las siguientes 6 personas.

In [2]:
personas=['Olga','Eduardo','Marisol','Saul','Karla','Alan']

serie={'Nombre':pd.Series(personas,index=['Olga','Eduardo','Marisol','Saul','Karla','Alan'])}
a=pd.DataFrame(serie)
a

          Nombre
Olga        Olga
Eduardo  Eduardo
Marisol  Marisol
Saul        Saul
Karla      Karla
Alan        Alan

Como aqui aún no tenemos parejas entronces relacionamos por si solo sus nombres para que se empiezen a movel nombres en la tabla, ya cuando se vallan asignando las parejas.

In [3]:
persona4=[a.iloc[4,0],a.iloc[5,0],a.iloc[1,0],a.iloc[0,0]]

La primer persona hara la primer seleccion

In [4]:
persona1=['Eduardo','Karla','Marisol','Alan']
persona2=['Saul','Olga','Marisol','Alan']
persona3=['Marisol','Karla','Alan','Olga']
#persona4=['Karla','Marisol','Saul','Eduardo'],
persona5=['Olga','Karla','Eduardo','Saul']
persona6=['Alan','Marisol','Eduardo','Saul']

In [5]:
seleccionado=[persona1,
              persona2,
              persona3,
              persona4,
              persona5,
              persona6]

In [6]:
decision=[[a.iloc[1,0],a.iloc[4,0],a.iloc[2,0],a.iloc[5,0]],
        [a.iloc[4,0],a.iloc[0,0],a.iloc[5,0],a.iloc[2,0]],
        [a.iloc[0,0],a.iloc[4,0],a.iloc[1,0],a.iloc[3,0]],
        [a.iloc[4,0],a.iloc[5,0],a.iloc[2,0],a.iloc[0,0]],
        [a.iloc[1,0],a.iloc[2,0],a.iloc[3,0],a.iloc[5,0]],
        [a.iloc[3,0],a.iloc[0,0],a.iloc[1,0],a.iloc[2,0]]]

In [7]:
tabla=pd.DataFrame(decision,index=personas)
#tabla=pd.DataFrame(seleccionado,index=personas,columns={'Primera opcion','Segunda opcion','Tercera opcion','Cuarta opcion'})
tabla

               0        1        2        3
Olga     Eduardo    Karla  Marisol     Alan
Eduardo    Karla     Olga     Alan  Marisol
Marisol     Olga    Karla  Eduardo     Saul
Saul       Karla     Alan  Marisol     Olga
Karla    Eduardo  Marisol     Saul     Alan
Alan        Saul     Olga  Eduardo  Marisol

In [8]:
tabla.iloc[0]

0    Eduardo
1      Karla
2    Marisol
3       Alan
Name: Olga, dtype: object

In [9]:
seleccion={'Olga':pd.Series(persona1),
           'Eduardo':pd.Series(persona2),
           'Marisol':pd.Series(persona3),
           'Saul':pd.Series(persona4),
           'Karla':pd.Series(persona5),
           'Alan':pd.Series(persona6)}
s=pd.DataFrame(seleccion)
s

      Olga  Eduardo  Marisol     Saul    Karla     Alan
0  Eduardo     Saul  Marisol    Karla     Olga     Alan
1    Karla     Olga    Karla     Alan    Karla  Marisol
2  Marisol  Marisol     Alan  Eduardo  Eduardo  Eduardo
3     Alan     Alan     Olga     Olga     Saul     Saul

Vemos que cada persona tiene solamente cuatro opciones. Para esto, entonces debemos saber las propuestas que todos hicieron para saber quien acepto propuesta y quien no.

In [11]:
n=6  #Numero de personas
parejas=[None]*n    #Parejas
personas=[None]*n   #personas disponibles

numero=0
numero2=0
i=0

while (i<=3):
    persona=a.iloc[numero,0]   #Se busca la info de la persona disponible y ver si aún no tiene pareja

    preferencias=s.iloc[numero]    #Aqui van las preferencias de las personas para que se valla cerrando mas el circulo hasta llegar con su pareja 
    persona2=a.iloc[numero2,0]

    preferencias2=s.iloc[:,numero2]
    pareja=personas[numero2]
    
    if (pareja==None):    #Aqui analizamos si una persona no tiene pareja, se le asigna una de acuerdo a su preferencia y viceversa
        personas[numero2]=persona
        parejas[numero]=persona2
        numero+=1
        numero2=0
        i+=1
    else:
        indice=preferencias2.index[numero]
        indice_persona1=preferencias2.index[numero2]
        if indice>indice_persona1:
            personas[numero2]=persona
            parejas[numero]=persona2
            numero+=1
            numero2=0
            i+=1
        else:
            numero2+=1

final={'Persona 1':pd.Series(personas),
      'Persona 2':pd.Series(parejas)}
pintar=pd.DataFrame(final)
pintar

  Persona 1 Persona 2
0      Saul      Olga
1      None      Olga
2      None      Olga
3      None      Olga
4      None      None
5      None      None